2016/brp 2016-02-09/art/art-data/resources/resources/RequestTemplates/PUC501-OPvB-BepalenPersonenOpAdresMetRelaties_request_template.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header>${DataSource Values#Header_EEE0}</soapenv:Header>
	<soapenv:Body>
		<brp:bhg_bvgGeefPersonenOpAdresMetBetrokkenheden xmlns:brp="http://www.bzk.nl/brp/brp0200">
			<brp:stuurgegevens brp:communicatieID="comid.stuurgegevens00B">
				<brp:zendendePartij>${DataSource Values#zendendePartij_zsA0}</brp:zendendePartij>
				<brp:zendendeSysteem>${DataSource Values#zendendeSysteem_zsA0}</brp:zendendeSysteem>
				<brp:referentienummer>${DataSource Values#referentienummer_sAB0}</brp:referentienummer>
				<brp:tijdstipVerzending>[moment_volgen]</brp:tijdstipVerzending>
			</brp:stuurgegevens>
			<brp:parameters brp:communicatieID="parameters">
				<brp:peilmomentMaterieelSelectie>${DataSource Values#peilmomentMaterieelSelectie_pAB0}</brp:peilmomentMaterieelSelectie>
			</brp:parameters>
				<brp:zoekcriteriaPersoon brp:communicatieID="zoekcriteria">
					<brp:burgerservicenummer>${DataSource Values#burgerservicenummer_zvA0}</brp:burgerservicenummer>
					<brp:gemeenteCode>${DataSource Values#gemeenteCode_zvA0}</brp:gemeenteCode>
					<brp:naamOpenbareRuimte>${DataSource Values#naamOpenbareRuimte_zvA0}</brp:naamOpenbareRuimte>
					<brp:huisnummer>${DataSource Values#huisnummer_zvA0}</brp:huisnummer>
					<brp:huisletter>${DataSource Values#huisletter_zvA0}</brp:huisletter>
					<brp:huisnummertoevoeging>${DataSource Values#huisnummertoevoeging_zvA0}</brp:huisnummertoevoeging>
					<brp:postcode>${DataSource Values#postcode_zvA0}</brp:postcode>
				</brp:zoekcriteriaPersoon>
		</brp:bhg_bvgGeefPersonenOpAdresMetBetrokkenheden>
	</soapenv:Body>
</soapenv:Envelope>
