2016/brp 2016-02-09/art/art-data/resources/resources/RequestTemplates/PUC501-OPvB-OpvragenDetailsPersoonEnRelaties_request_template.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header/>
	<soapenv:Body>
		<brp:bhg_bvgGeefDetailsPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
			<brp:stuurgegevens brp:communicatieID="comid.stuurgegevens00B">
				<brp:zendendePartij>${DataSource Values#zendendePartij_zsA0}</brp:zendendePartij>
				<brp:zendendeSysteem>${DataSource Values#zendendeSysteem_zsA0}</brp:zendendeSysteem>
				<brp:referentienummer>${DataSource Values#referentienummer_sAA0}</brp:referentienummer>
				<brp:tijdstipVerzending>${DataSource Values#tijdstipVerzending_sAA0}</brp:tijdstipVerzending>
			</brp:stuurgegevens>
			<brp:parameters brp:communicatieID="parameters">
				<brp:peilmomentMaterieelResultaat>${DataSource Values#peilmomentMaterieelResultaat_zvA0}</brp:peilmomentMaterieelResultaat>
				<brp:peilmomentFormeelResultaat>${DataSource Values#peilmomentFormeelResultaat_zvA0}</brp:peilmomentFormeelResultaat>
				<brp:historievorm>${DataSource Values#historievorm_zvA0}</brp:historievorm>
			</brp:parameters>
			<brp:zoekcriteriaPersoon brp:communicatieID="${DataSource Values#|zoekcriteria|}">
				<brp:burgerservicenummer>${DataSource Values#burgerservicenummer_zvA0}</brp:burgerservicenummer>
				<brp:administratienummer>${DataSource Values#administratienummer_zvA0}</brp:administratienummer>
				<brp:objectSleutel>${DataSource Values#objectSleutel_zvA0}</brp:objectSleutel>
			</brp:zoekcriteriaPersoon>
		</brp:bhg_bvgGeefDetailsPersoon>
	</soapenv:Body>
</soapenv:Envelope>
