2016/brp 2016-02-09/art/art-data/resources/resources/RequestTemplates/PUC501-Kandidaat-Vader_request_template.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header>${DataSource Values#Header_EEE0}</soapenv:Header>
	<soapenv:Body>
		<brp:bhg_bvgBepaalKandidaatVader xmlns:brp="http://www.bzk.nl/brp/brp0200">
			<brp:stuurgegevens brp:communicatieID="comid.stuurgegevens00B">
				<brp:zendendePartij>${DataSource Values#zendendePartij_zsA0}</brp:zendendePartij>
				<brp:zendendeSysteem>${DataSource Values#zendendeSysteem_zsA0}</brp:zendendeSysteem>
				<brp:referentienummer>${DataSource Values#referentienummer_sAB0}</brp:referentienummer>
				<brp:tijdstipVerzending>[moment_volgen]</brp:tijdstipVerzending>
			</brp:stuurgegevens>
			<brp:zoekcriteriaPersoon brp:communicatieID="zoekcriteria">
				<brp:burgerservicenummer>${DataSource Values#burgerservicenummer_zvA0}</brp:burgerservicenummer>
				<brp:geboortedatumKind>${DataSource Values#geboortedatumKind_zvA0}</brp:geboortedatumKind>
			</brp:zoekcriteriaPersoon>
		</brp:bhg_bvgBepaalKandidaatVader>
	</soapenv:Body>
</soapenv:Envelope>
