2016/brp 2016-02-09/art/art-proeftuin/PUC501-DetailsPersoon/ART/ActualResults/soap/request/bevraging_bsn_100000010-1-soaprequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <brp:bhg_bvgGeefDetailsPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
         <brp:stuurgegevens brp:communicatieID="comid.stuurgegevens00B">
            <brp:zendendePartij>036101</brp:zendendePartij>
            <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
            <brp:referentienummer>10000000-0000-0000-0501-200000000001</brp:referentienummer>
            <brp:tijdstipVerzending>2014-12-12T12:00:27.326</brp:tijdstipVerzending>
         </brp:stuurgegevens>
         <brp:zoekcriteriaPersoon brp:communicatieID="zoekcriteria">
            <brp:burgerservicenummer>100000010</brp:burgerservicenummer>
         </brp:zoekcriteriaPersoon>
      </brp:bhg_bvgGeefDetailsPersoon>
   </soapenv:Body>
</soapenv:Envelope>